export const data = {
  Алматы: {
    Данные: {
      "Общее количество": 10,
      "Фактическое количество": 10,
    },
    Подразделения: {
      "Управление 1": {
        Данные: {
          "Общее количество": 20,
          "Фактическое количество": 15,
        },
        Подразделения: {
          "Отдел 1": {
            Данные: {
              "Общее количество": 30,
              "Фактическое количество": 20,
            },
            Подразделения: {
              "Команда 1": {
                Данные: {
                  "Общее количество": 40,
                  "Фактическое количество": 25,
                },
              },
            },
          },
          "Отдел 2": {
            Данные: {
              "Общее количество": 11,
              "Фактическое количество": 11,
            },
            Подразделения: {
              "Команда 1": {
                Данные: {
                  "Общее количество": 22,
                  "Фактическое количество": 22,
                },
              },
            },
          },
        },
      },
    },
  },
  "Нур-султан": {
    Данные: {
      "Общее количество": 10,
      "Фактическое количество": 10,
    },
    Подразделения: {
      "Управление 1": {
        Данные: {
          "Общее количество": 20,
          "Фактическое количество": 15,
        },
        Подразделения: {
          "Отдел 1": {
            Данные: {
              "Общее количество": 30,
              "Фактическое количество": 20,
            },
            Подразделения: {
              "Команда 1": {
                Данные: {
                  "Общее количество": 40,
                  "Фактическое количество": 25,
                },
              },
            },
          },
          "Отдел 2": {
            Данные: {
              "Общее количество": 11,
              "Фактическое количество": 11,
            },
            Подразделения: {
              "Команда 1": {
                Данные: {
                  "Общее количество": 22,
                  "Фактическое количество": 22,
                },
              },
            },
          },
        },
      },
    },
  },
  Актау: {
    Данные: {
      "Общее количество": 10,
      "Фактическое количество": 10,
    },
    Подразделения: {
      "Управление 1": {
        Данные: {
          "Общее количество": 20,
          "Фактическое количество": 15,
        },
        Подразделения: {
          "Отдел 1": {
            Данные: {
              "Общее количество": 30,
              "Фактическое количество": 20,
            },
            Подразделения: {
              "Команда 1": {
                Данные: {
                  "Общее количество": 40,
                  "Фактическое количество": 25,
                },
              },
            },
          },
          "Отдел 2": {
            Данные: {
              "Общее количество": 11,
              "Фактическое количество": 11,
            },
            Подразделения: {
              "Команда 1": {
                Данные: {
                  "Общее количество": 22,
                  "Фактическое количество": 22,
                },
              },
            },
          },
        },
      },
    },
  },
};

export const oldData = {
  "Нур-султан": {
    "Центр 1": {
      "Управление 1": {
        "Отдел 1": {
          "Вложение 1": {
            "Вложение 1.1": {
              "Общее количество": 10,
              "Фактическое количество": 12,
            },
          },
          "Вложение 2": {
            "Вложение 2.1": {
              "Общее количество": 31,
              "Фактическое количество": 29,
            },
          },
          "Вложение 3": {
            "Вложение 3.1": {
              "Вложение 3.1.1": {
                "Вложение 3.1.1.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
              },
              "Вложение 3.1.2": {
                "Вложение 3.1.2.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
                "Вложение 3.1.2.2": {
                  "Общее количество": 32,
                  "Фактическое количество": 29,
                },
              },
            },
          },
        },
      },
    },
  },
  Актау: {
    "Центр 1": {
      "Управление 1": {
        "Отдел 1": {
          "Вложение 1": {
            "Вложение 1.1": {
              "Общее количество": 10,
              "Фактическое количество": 12,
            },
          },
          "Вложение 2": {
            "Вложение 2.1": {
              "Общее количество": 31,
              "Фактическое количество": 29,
            },
          },
          "Вложение 3": {
            "Вложение 3.1": {
              "Вложение 3.1.1": {
                "Вложение 3.1.1.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
              },
              "Вложение 3.1.2": {
                "Вложение 3.1.2.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
                "Вложение 3.1.2.2": {
                  "Общее количество": 32,
                  "Фактическое количество": 29,
                },
              },
            },
          },
        },
      },
    },
    "Центр 2": {
      "Управление 1": {
        "Отдел 1": {
          "Вложение 1": {
            "Вложение 1.1": {
              "Общее количество": 10,
              "Фактическое количество": 12,
            },
          },
          "Вложение 2": {
            "Вложение 2.1": {
              "Общее количество": 31,
              "Фактическое количество": 29,
            },
          },
          "Вложение 3": {
            "Вложение 3.1": {
              "Вложение 3.1.1": {
                "Вложение 3.1.1.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
              },
              "Вложение 3.1.2": {
                "Вложение 3.1.2.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
                "Вложение 3.1.2.2": {
                  "Общее количество": 32,
                  "Фактическое количество": 29,
                },
              },
            },
          },
        },
      },
    },
    "Центр 3": {
      "Управление 1": {
        "Отдел 1": {
          "Вложение 1": {
            "Вложение 1.1": {
              "Общее количество": 10,
              "Фактическое количество": 12,
            },
          },
          "Вложение 2": {
            "Вложение 2.1": {
              "Общее количество": 31,
              "Фактическое количество": 29,
            },
          },
          "Вложение 3": {
            "Вложение 3.1": {
              "Вложение 3.1.1": {
                "Вложение 3.1.1.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
              },
              "Вложение 3.1.2": {
                "Вложение 3.1.2.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
                "Вложение 3.1.2.2": {
                  "Общее количество": 32,
                  "Фактическое количество": 29,
                },
              },
            },
          },
        },
      },
    },
    "Центр 4": {
      "Управление 1": {
        "Отдел 1": {
          "Вложение 1": {
            "Вложение 1.1": {
              "Общее количество": 10,
              "Фактическое количество": 12,
            },
          },
          "Вложение 2": {
            "Вложение 2.1": {
              "Общее количество": 31,
              "Фактическое количество": 29,
            },
          },
          "Вложение 3": {
            "Вложение 3.1": {
              "Вложение 3.1.1": {
                "Вложение 3.1.1.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
              },
              "Вложение 3.1.2": {
                "Вложение 3.1.2.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
                "Вложение 3.1.2.2": {
                  "Общее количество": 32,
                  "Фактическое количество": 29,
                },
              },
            },
          },
        },
      },
    },
    "Центр 5": {
      "Управление 1": {
        "Отдел 1": {
          "Вложение 1": {
            "Вложение 1.1": {
              "Общее количество": 10,
              "Фактическое количество": 12,
            },
          },
          "Вложение 2": {
            "Вложение 2.1": {
              "Общее количество": 31,
              "Фактическое количество": 29,
            },
          },
          "Вложение 3": {
            "Вложение 3.1": {
              "Вложение 3.1.1": {
                "Вложение 3.1.1.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
              },
              "Вложение 3.1.2": {
                "Вложение 3.1.2.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
                "Вложение 3.1.2.2": {
                  "Общее количество": 32,
                  "Фактическое количество": 29,
                },
              },
            },
          },
        },
      },
    },
    "Центр 6": {
      "Управление 1": {
        "Отдел 1": {
          "Вложение 1": {
            "Вложение 1.1": {
              "Общее количество": 10,
              "Фактическое количество": 12,
            },
          },
          "Вложение 2": {
            "Вложение 2.1": {
              "Общее количество": 31,
              "Фактическое количество": 29,
            },
          },
          "Вложение 3": {
            "Вложение 3.1": {
              "Вложение 3.1.1": {
                "Вложение 3.1.1.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
              },
              "Вложение 3.1.2": {
                "Вложение 3.1.2.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
                "Вложение 3.1.2.2": {
                  "Общее количество": 32,
                  "Фактическое количество": 29,
                },
              },
            },
          },
        },
      },
    },
    "Центр 7": {
      "Управление 1": {
        "Отдел 1": {
          "Вложение 1": {
            "Вложение 1.1": {
              "Общее количество": 10,
              "Фактическое количество": 12,
            },
          },
          "Вложение 2": {
            "Вложение 2.1": {
              "Общее количество": 31,
              "Фактическое количество": 29,
            },
          },
          "Вложение 3": {
            "Вложение 3.1": {
              "Вложение 3.1.1": {
                "Вложение 3.1.1.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
              },
              "Вложение 3.1.2": {
                "Вложение 3.1.2.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
                "Вложение 3.1.2.2": {
                  "Общее количество": 32,
                  "Фактическое количество": 29,
                },
              },
            },
          },
        },
      },
    },
    "Центр 8": {
      "Управление 1": {
        "Отдел 1": {
          "Вложение 1": {
            "Вложение 1.1": {
              "Общее количество": 10,
              "Фактическое количество": 12,
            },
          },
          "Вложение 2": {
            "Вложение 2.1": {
              "Общее количество": 31,
              "Фактическое количество": 29,
            },
          },
          "Вложение 3": {
            "Вложение 3.1": {
              "Вложение 3.1.1": {
                "Вложение 3.1.1.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
              },
              "Вложение 3.1.2": {
                "Вложение 3.1.2.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
                "Вложение 3.1.2.2": {
                  "Общее количество": 32,
                  "Фактическое количество": 29,
                },
              },
            },
          },
        },
      },
    },
    "Центр 9": {
      "Управление 1": {
        "Отдел 1": {
          "Вложение 1": {
            "Вложение 1.1": {
              "Общее количество": 10,
              "Фактическое количество": 12,
            },
          },
          "Вложение 2": {
            "Вложение 2.1": {
              "Общее количество": 31,
              "Фактическое количество": 29,
            },
          },
          "Вложение 3": {
            "Вложение 3.1": {
              "Вложение 3.1.1": {
                "Вложение 3.1.1.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
              },
              "Вложение 3.1.2": {
                "Вложение 3.1.2.1": {
                  "Общее количество": 31,
                  "Фактическое количество": 29,
                },
                "Вложение 3.1.2.2": {
                  "Общее количество": 32,
                  "Фактическое количество": 29,
                },
              },
            },
          },
        },
      },
    },
  },
};
